DataProcessors/А_АвтоматическийОбменДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>А_АвтоматическийОбменДанными</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменУправлениеПредприятиемБухгалтерия20</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.КазначействоBASERP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/А_НастройкиПодключенияБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_НастройкиПодключенияБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменУправлениеПредприятиемБухгалтерия20</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.КазначействоBASERP</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКОбработкеПланаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/А_АвтоматическийОбменДанными/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ЗакрытьПослеОбмена; // Режим планировщика: Истина — закрыть приложение после автозапуска обмена.

#Область ОбработчикиСобытийФормы

// ВАЖНО: события ОБЪЯВЛЕНЫ в Form.xml —
//   <Events><Event name="OnCreateAtServer">ПриСозданииНаСервере</Event>
//           <Event name="OnOpen">ПриОткрытии</Event></Events>
// Без этого объявления платформа обработчики НЕ вызывает (молча).
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Вызов из ОбщаяФорма.СинхронизацияДанных (подменю «Полная синхронизация»):
	// узел корреспондента приходит параметром, обмен стартует автоматически (см. ПриОткрытии).
	Если Параметры.Свойство("ЗапуститьВсе") И Параметры.ЗапуститьВсе = Истина Тогда
		АвтоЗапуск = "Все";
	ИначеЕсли Параметры.Свойство("ПланОбмена") И ЗначениеЗаполнено(Параметры.ПланОбмена) Тогда
		Объект.ПланОбмена = Параметры.ПланОбмена;
		Если ЗначениеЗаполнено(Объект.ПланОбмена) Тогда
			АвтоЗапуск = "Текущий";
		Иначе
			// Узел плана, не подключённого к обработке (нет в составном типе реквизита).
			Результат = "Для корреспондента """ + Строка(Параметры.ПланОбмена)
				+ """ полный обмен не настроен: его план обмена не подключён к обработке.";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Запуск из планировщика заданий: 1cv8 ENTERPRISE ... /Execute "...epf" /CSYNCALL.
	// При /Execute внешней обработки реквизиты формы Параметры не заполняются, поэтому
	// режим «по всем базам» берём из ПараметрЗапуска, а после обмена закрываем приложение.
	Если НЕ ЗначениеЗаполнено(АвтоЗапуск) И ВРег(СокрЛП(ПараметрЗапуска)) = "SYNCALL" Тогда
		АвтоЗапуск = "Все";
		ЗакрытьПослеОбмена = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(АвтоЗапуск) Тогда
		ПодключитьОбработчикОжидания("АвтоЗапускОбмена", 0.5, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Полный обмен с выбранной базой-корреспондентом: <корреспондент> -> ERP -> <корреспондент>.
// План обмена выбирается на форме (Объект.ПланОбмена); ВСЕ параметры (сервер, имя базы,
// учётка, путь к обработке-исполнителю) берутся ИЗ РЕГИСТРА А_НастройкиПодключенияБаз
// по этому плану. В обработке по базам ничего не захардкожено — она переносима.
&НаКлиенте
Процедура ПолныйОбмен(Команда)

	ЗапуститьОбменПоТекущемуПлану();

КонецПроцедуры

// Полный обмен по ВСЕМ базам с заполненным планом обмена в регистре
// А_НастройкиПодключенияБаз, последовательно (порядок — по идентификатору базы:
// bas_industrialbud, затем kazna). Сбой одной цепочки не останавливает следующие.
&НаКлиенте
Процедура ПолныйОбменПоВсем(Команда)

	ЗапуститьОбменПоВсемБазам();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик ожидания автозапуска (открытие из ОбщаяФорма.СинхронизацияДанных).
&НаКлиенте
Процедура АвтоЗапускОбмена()

	Если АвтоЗапуск = "Все" Тогда
		ЗапуститьОбменПоВсемБазам();
	Иначе
		ЗапуститьОбменПоТекущемуПлану();
	КонецЕсли;

	// Режим планировщика: после завершения обмена штатно закрыть приложение,
	// чтобы задание планировщика завершилось.
	Если ЗакрытьПослеОбмена = Истина Тогда
		ЗавершитьРаботуСистемы(Ложь, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменПоТекущемуПлану()

	Если НЕ ЗначениеЗаполнено(Объект.ПланОбмена) Тогда
		Результат = "Выберите план обмена.";
		Возврат;
	КонецЕсли;

	Настройки = НастройкиПоПлану(Объект.ПланОбмена);
	Если Настройки = Неопределено Тогда
		Результат = "В регистре ""А_НастройкиПодключенияБаз"" нет строки с выбранным планом обмена ("
			+ Строка(Объект.ПланОбмена) + "). Заполните регистр.";
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Настройки.ПутьКОбработке) Тогда
		Результат = "Для этой базы в регистре не заполнен ""Путь к обработке плана обмена"" (А_ЗапуститьОбмен.epf).";
		Возврат;
	КонецЕсли;

	Лог = Новый Массив;
	ВыполнитьЦепочку(Настройки, Лог);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменПоВсемБазам()

	ВсеНастройки = ВсеНастройкиОбмена();
	Если ВсеНастройки.Количество() = 0 Тогда
		Результат = "В регистре ""А_НастройкиПодключенияБаз"" нет ни одной строки с заполненным планом обмена.";
		Возврат;
	КонецЕсли;

	Лог = Новый Массив;
	Для Каждого Настройки Из ВсеНастройки Цикл

		Если Лог.Количество() > 0 Тогда
			Лог.Добавить("");
		КонецЕсли;
		Лог.Добавить("=== " + Настройки.ИмяБазы + " (план " + Настройки.ИмяПлана + ") ===");
		Результат = СтрСоединить(Лог, Символы.ПС);

		Если НЕ ЗначениеЗаполнено(Настройки.ПутьКОбработке) Тогда
			Лог.Добавить("ПРОПУЩЕНО: в регистре не заполнен ""Путь к обработке плана обмена"".");
			Результат = СтрСоединить(Лог, Символы.ПС);
			Продолжить;
		КонецЕсли;

		ВыполнитьЦепочку(Настройки, Лог);

	КонецЦикла;

КонецПроцедуры

// Читает параметры обмена из регистра А_НастройкиПодключенияБаз по выбранному плану обмена.
// Ни сервер, ни имя базы, ни учётка, ни путь не захардкожены — всё из регистра.
//
// Параметры:
//  ПланОбмена - ПланОбменаСсылка - узел плана обмена (реквизит Объект.ПланОбмена).
//
// Возвращаемое значение:
//  Структура (Сервер, ИмяБазы, Пользователь, Пароль, ПутьКОбработке, ИмяПлана)
//  или Неопределено, если строки регистра с таким планом нет.
//
&НаСервереБезКонтекста
Функция НастройкиПоПлану(ПланОбмена)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("План", ПланОбмена);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Сервер КАК Сервер,
	|	Настройки.ИмяБазы КАК ИмяБазы,
	|	Настройки.Пользователь КАК Пользователь,
	|	Настройки.Пароль КАК Пароль,
	|	Настройки.ПутьКОбработкеПланаОбмена КАК ПутьКОбработке
	|ИЗ
	|	РегистрСведений.А_НастройкиПодключенияБаз КАК Настройки
	|ГДЕ
	|	Настройки.ПланОбмена = &План";

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Сервер",         СокрЛП(Выборка.Сервер));
	Результат.Вставить("ИмяБазы",        СокрЛП(Выборка.ИмяБазы));
	Результат.Вставить("Пользователь",   СокрЛП(Выборка.Пользователь));
	Результат.Вставить("Пароль",         СокрЛП(Выборка.Пароль));
	Результат.Вставить("ПутьКОбработке", СокрЛП(Выборка.ПутьКОбработке));
	// Имя плана обмена для шага 2 (обмен в ERP) — из самой ссылки, без хардкода строк.
	Результат.Вставить("ИмяПлана",       ПланОбмена.Метаданные().Имя);

	Возврат Результат;

КонецФункции

// Все строки регистра А_НастройкиПодключенияБаз с заполненным планом обмена,
// в порядке идентификатора базы (bas_industrialbud, kazna, ...).
// Новая база подключается ОДНОЙ строкой регистра — без правки кода.
//
// Возвращаемое значение:
//  Массив из Структура (Сервер, ИмяБазы, Пользователь, Пароль, ПутьКОбработке, ИмяПлана).
//
&НаСервереБезКонтекста
Функция ВсеНастройкиОбмена()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Сервер КАК Сервер,
	|	Настройки.ИмяБазы КАК ИмяБазы,
	|	Настройки.Пользователь КАК Пользователь,
	|	Настройки.Пароль КАК Пароль,
	|	Настройки.ПутьКОбработкеПланаОбмена КАК ПутьКОбработке,
	|	Настройки.ПланОбмена КАК ПланОбмена
	|ИЗ
	|	РегистрСведений.А_НастройкиПодключенияБаз КАК Настройки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Настройки.ИдентификаторБазы";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(Выборка.ПланОбмена) Тогда
			Продолжить; // строка без плана обмена (zup, zup2) — полный обмен не для неё
		КонецЕсли;

		Настройки = Новый Структура;
		Настройки.Вставить("Сервер",         СокрЛП(Выборка.Сервер));
		Настройки.Вставить("ИмяБазы",        СокрЛП(Выборка.ИмяБазы));
		Настройки.Вставить("Пользователь",   СокрЛП(Выборка.Пользователь));
		Настройки.Вставить("Пароль",         СокрЛП(Выборка.Пароль));
		Настройки.Вставить("ПутьКОбработке", СокрЛП(Выборка.ПутьКОбработке));
		Настройки.Вставить("ИмяПлана",       Выборка.ПланОбмена.Метаданные().Имя);
		Результат.Добавить(Настройки);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Обмен ТЕКУЩЕЙ базы (ERP) прямо в этой сессии, ТОЛЬКО по плану выбранной цепочки:
// иначе обмен дёрнул бы заодно и другую пару (в ERP есть узлы обоих планов).
&НаСервере
Функция ОбменТекущейБазыПоПлануНаСервере(ИмяПлана)

	Обработка = РеквизитФормыВЗначение("Объект");
	Сообщения = Новый Массив;
	Обработка.СинхронизироватьПоПлану(ИмяПлана, Сообщения);

	Если Сообщения.Количество() = 0 Тогда
		Возврат "план " + ИмяПлана + ": узел обмена в текущей базе не найден — шаг пропущен.";
	КонецЕсли;

	Возврат СтрСоединить(Сообщения, Символы.ПС);

КонецФункции

// Оркестратор цепочки: <база-корреспондент> -> ERP -> <база-корреспондент>.
// Шаги 1 и 3 — запуск толстого клиента базы-корреспондента с обработкой-исполнителем
// (путь берётся из регистра). Шаг 2 — обмен ERP выполняется В ТЕКУЩЕЙ СЕССИИ.
//
// Параметры:
//  Настройки - Структура - результат НастройкиПоПлану() / элемент ВсеНастройкиОбмена().
//  Лог       - Массив    - лог выполнения; создаёт ВЫЗЫВАЮЩИЙ (в режиме «по всем базам»
//                          лог общий на несколько цепочек).
//
&НаКлиенте
Процедура ВыполнитьЦепочку(Настройки, Лог)

	ЗаписатьВЖурнал("Полный обмен: старт цепочки " + Настройки.ИмяБазы + " -> ERP -> "
		+ Настройки.ИмяБазы + " (план обмена " + Настройки.ИмяПлана + ")");

	ЕстьСбой = Ложь;

	// Шаг 1 — обмен в базе-корреспонденте (запуск толстого клиента).
	Если НЕ ШагЗапускаБазы(1, Настройки, Лог) Тогда
		ЕстьСбой = Истина;
	КонецЕсли;

	// Шаг 2 — обмен ERP В ТЕКУЩЕЙ СЕССИИ, только по плану этой цепочки.
	Лог.Добавить("Шаг 2 — обмен в текущей базе (ERP) по плану " + Настройки.ИмяПлана + ", без запуска клиента ...");
	Результат = СтрСоединить(Лог, Символы.ПС);

	ИтогERP = ОбменТекущейБазыПоПлануНаСервере(Настройки.ИмяПлана);
	Лог.Добавить("   " + СтрЗаменить(ИтогERP, Символы.ПС, Символы.ПС + "   "));
	Результат = СтрСоединить(Лог, Символы.ПС);
	ЗаписатьВЖурнал("Полный обмен: шаг 2 (текущая база ERP) — " + ИтогERP);

	// Шаг 3 — обмен в базе-корреспонденте ещё раз (принять встречное сообщение от ERP).
	Если НЕ ШагЗапускаБазы(3, Настройки, Лог) Тогда
		ЕстьСбой = Истина;
	КонецЕсли;

	Если ЕстьСбой Тогда
		Лог.Добавить("Итог: цепочка пройдена, но есть шаги с ненулевым кодом возврата.");
	Иначе
		Лог.Добавить("Итог: полный обмен " + Настройки.ИмяБазы + " → ERP → " + Настройки.ИмяБазы
			+ " выполнен. Подробности — в Журнале регистрации (событие А_АвтоматическийОбмен).");
	КонецЕсли;
	Результат = СтрСоединить(Лог, Символы.ПС);

	ЗаписатьВЖурнал("Полный обмен: цепочка завершена" + ?(ЕстьСбой, " (были сбои)", " успешно"));

КонецПроцедуры

// Запускает толстый клиент указанной базы с обработкой-исполнителем и ЖДЁТ её завершения.
// Возвращаемое значение:
//  Булево - Истина, если код возврата = 0 (сессия отработала и закрылась штатно).
&НаКлиенте
Функция ШагЗапускаБазы(Номер, Настройки, Лог)

	Лог.Добавить("Шаг " + Номер + " — запуск обмена в базе " + Настройки.ИмяБазы
		+ " (сервер " + Настройки.Сервер + ") ...");
	Результат = СтрСоединить(Лог, Символы.ПС);

	КодВозврата = Неопределено;
	ЗапуститьПриложение(КомандаЗапуска(Настройки), КаталогПрограммы(), Истина, КодВозврата);

	Успех = (КодВозврата = 0);
	Если Успех Тогда
		Итог = "завершено (сессия закрылась штатно)";
	Иначе
		Итог = "ВНИМАНИЕ: код возврата = " + Строка(КодВозврата)
			+ " (сессия не закрылась штатно — см. Журнал регистрации базы " + Настройки.ИмяБазы + ")";
	КонецЕсли;

	Лог.Добавить("   ... " + Настройки.ИмяБазы + ": " + Итог);
	Результат = СтрСоединить(Лог, Символы.ПС);

	ЗаписатьВЖурнал("Полный обмен: шаг " + Номер + " (" + Настройки.ИмяБазы + ") — " + Итог);

	Возврат Успех;

КонецФункции

// Командная строка запуска толстого клиента.
// Путь к 1cv8.exe берём из КаталогПрограммы() — каталог ЗАПУЩЕННОГО клиента,
// поэтому команда корректна на любом сервере без настройки.
&НаКлиенте
Функция КомандаЗапуска(Настройки)

	Каталог = КаталогПрограммы();
	Если Прав(Каталог, 1) <> "\" Тогда
		Каталог = Каталог + "\";
	КонецЕсли;
	КлиентEXE = """" + Каталог + "1cv8.exe""";

	Возврат КлиентEXE + " ENTERPRISE"
		+ " /S """ + Настройки.Сервер + "\" + Настройки.ИмяБазы + """"
		+ " /N """ + Настройки.Пользователь + """ /P """ + Настройки.Пароль + """"
		+ " /DisableStartupDialogs /DisableStartupMessages"
		+ " /Execute """ + Настройки.ПутьКОбработке + """";

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьВЖурнал(Текст)
	Попытка
		ЗаписьЖурналаРегистрации("А_АвтоматическийОбмен",
			УровеньЖурналаРегистрации.Информация, , , Строка(Текст));
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
